Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [51]:
import pandas as pd

In [52]:
import requests
import zipfile

In [53]:
url =  "http://files.grouplens.org/datasets/movielens/ml-latest-small.zip"
zipFile = requests.get(url)

In [54]:
with open("ml-latest-small.zip", "wb") as f:
    f.write(zipFile.content)
unzip_files("ml-latest-small.zip", "")

ml-latest-small/
ml-latest-small/links.csv
ml-latest-small/tags.csv
ml-latest-small/ratings.csv
ml-latest-small/README.txt
ml-latest-small/movies.csv

In [55]:
ratings = pd.read_csv("./ml-latest-small/ratings.csv")
movies =  pd.read_csv("./ml-latest-small/movies.csv")

In [56]:
max_movie_rating = ratings[(ratings['rating'] == 5)]['movieId'].value_counts().idxmax()

In [58]:
five_stars_movie = movies[(movies['movieId'] == max_movie_rating)]
five_stars_movie

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [10]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [11]:
#data['country'].unique()

In [12]:
data[ data['country'].str.contains('ia', case=False) ]['country'].unique()

array(['Austria', 'Czechia', 'Romania', 'Serbia', 'Slovakia', 'Bulgaria',
       'Croatia', 'Lithuania', 'Other Asia', 'T.F.Yug.Rep. Macedonia',
       'Colombia', 'Australia', 'Ethiopia', 'Serbia and Montenegro',
       'Tunisia', 'Georgia', 'Latvia', 'Armenia', 'Russian Federation',
       'Bolivia (Plur. State of)', 'Estonia', 'Ethiopia, incl. Eritrea',
       'French Guiana', 'Indonesia', 'Liberia', 'Malaysia', 'Mauritania',
       'Namibia', 'New Caledonia', 'Slovenia', 'United Rep. of Tanzania',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria',
       'French Polynesia', 'Syrian Arab Republic', 'India', 'Nigeria',
       'Somalia', 'Albania', 'Bosnia and Herzegovina',
       'Czechoslovakia (former)', 'Equatorial Guinea', 'Saudi Arabia',
       'St. Lucia', 'Mongolia', 'Cambodia', 'Gambia',
       'Micronesia (Fed. States of)', 'Northern Mariana Islands'],
      dtype=object)

In [23]:
filtered_country = data[ (data['country']== 'Lithuania')| (data['country']== 'Estonia') |  (data['country']== 'Latvia')]
filtered_country.head()
#len(filtered_country)

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [26]:
filtered_country[ 
    ((filtered_country['category']==4)|(filtered_country['category']==12)| (filtered_country['category']==21)) 
        & 
    (filtered_country['category'].isin([4,12,21]))
        &
    (filtered_country['year'].isin(range(2005,2010,1)))
        &
    (filtered_country['quantity']>=0)

]['quantity'].sum()

201719.0

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [28]:
pd.read_html('https://fortrader.org/quotes')[5]

,Type,Last,Chg.,Chg.%,Time
0,Bitcoin Курс биткоина,7346.650000,+21.160,0.289000,NaN
1,Litecoin Курс лайткоин к доллару (LTC/USD),48.692000,+0.285,0.589000,NaN
2,BitcoinCash Курс Биткоин кеш к доллару США (BC...,208.620000,-1.330,-0.633000,NaN
3,Dash Dash,55.830000,0.000,0.000000,NaN
4,Ripple Ripple,0.232090,+0.00052,0.224550,NaN
5,Ethereum Ethereum,153.066000,+0.123,0.080000,NaN
6,EmerCoin EmerCoin,0.140050,0.00000,0.000000,NaN
7,NameCoin NameCoin,0.274000,-0.051,-15.692000,NaN
8,PeerCoin PeerCoin,1.300000,+0.16,14.040000,NaN
9,BTCRUB биткоин в рублях,247059.000000,-3 097.00,-1.240000,NaN
10,BTCEUR биткоин в евро,6656.980000,+32.010,0.483000,NaN
11,Zcash (ZEC),29.714000,-0.072,-0.242000,NaN
12,NEO (NEO),9.897000,-0.156,-1.552000,NaN
13,EOS (EOS),2.661600,-0.0347,-1.286900,NaN
14,TRON (TRX),0.014584,-0.000551,-3.640568,NaN
15,Monero,51.721000,-0.353,-0.678000,NaN
16,Cardano,0.037640,-0.00070,-1.833450,NaN
17,IOTA,0.214010,-0.00191,-0.884590,NaN
18,"ETC/USD эфириум классик, ETC",3.953100,-0.0655,-1.629900,NaN

Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [31]:
dz = pd.read_csv('transactions.csv')
dz.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [32]:
dz_new = dz[dz['Product'] == "_8"].sort_values(by = 'Cost', ascending = False).head(1)
dz_new

    Year  Month    ID Product  Amount  Price  Total  Cost
54  2017     12  t055      _8       2   3760   7520  2400

In [33]:
dz_new['ID']

54    t055
Name: ID, dtype: object